app/Http/Controllers/Auth/RegisterController.php

insert into `users` (`name`, `email`, `ippis_no`, `phone_no`, `password`, `verification_code`, `id`, `updated_at`, `created_at`) values ('Admin2 Admin2', 'ralph.idokos@gmail.com', 'IPPIS000006', '08009000090', '$2y$10$T/WgdBO68TitZ3tULxEmFe/J5L8UILKdxvU3ydFgV6V0ClD8lIGhe', '9eb0ae4cc383589214c4d51e5fb2de72027dfaa9', '\"883cab29-7684-4b94-a440-b9b47b348b3b\"', '2022-03-20 22:55:37', '2022-03-20 22:55:37')
---
    public function register(Request $request)
    {
        $user = new User();
        $user->name = $request->name;
        $user->email = $request->email;
        $user->ippis_no = $request->ippis_no;
        $user->phone_no = $request->phone_no;
        $user->password = Hash::make($request->password);
        $user->verification_code = sha1(time());
        $user->save();

select * from `users` where (`verification_code` = '25d2c0f390e75f49cf0ec5d010a3241be7de8248') and `users`.`deleted_at` is null limit 1
update `users` set `is_verified` = 1, `users`.`updated_at` = '2022-03-20 22:58:50' where `id` = '133a9d0b-7265-4c97-b16d-45a1777dba1b'
---
    public function VerifyUserEmail(Request $request)
    {
        $verification_code = \Illuminate\Support\Facades\Request::get('code');
        $user = User::where(['verification_code'=>$verification_code])->first();
            if($user != null){
                $user->is_verified = 1;
                $user->save();