app/Listeners/CreateMemberAndBankListener.php

    public function handle($event)
    {
        //creating member's profile on the fly
        Member::create([
            'first_name' => $event->usersDetails->name,
            'email' => $event->usersDetails->email,
            'user_id' =>$event->usersDetails->id,
        ]);

        //creating banking details profile on the fly
        Bank::create([
             'account_name' => $event->usersDetails->name,
             'user_id' =>$event->usersDetails->id,
         ]);
---
insert into `members` (`first_name`, `email`, `user_id`, `id`, `updated_at`, `created_at`) values ('Admin2 Admin2', 'ralph.idokos@gmail.com', '\"883cab29-7684-4b94-a440-b9b47b348b3b\"', '\"1c4e2d7b-23e2-4f17-a630-deb03313ce92\"', '2022-03-20 22:55:37', '2022-03-20 22:55:37')
insert into `banks` (`account_name`, `user_id`, `updated_at`, `created_at`) values ('Admin2 Admin2', '\"883cab29-7684-4b94-a440-b9b47b348b3b\"', '2022-03-20 22:55:37', '2022-03-20 22:55:37')