app/Http/Livewire/AllowAdmin.php

select * from `users` where `id` = '53694d06-bb7d-44bb-9ec9-7b4c319850cb' and `users`.`deleted_at` is null limit 1
---
    public function grantAdminAccess()
    {
        $this->validate(['password'=>'required']);

        $user_password = User::where('id',Auth::id())->first()->password;