app/Http/Livewire/UpdateUserProfile.php

select * from `users` where `id` = '133a9d0b-7265-4c97-b16d-45a1777dba1b' and `users`.`deleted_at` is null limit 1
---
    public function storeImage()
    {
        if(!$this->image):
            return null;
        endif;
        $passport = User::where('id',Auth::id())->first()->passport_url;

update `banks` set `bank_name` = 'Fidelity Bank Plc', `account_name` = 'Blossom Ayers', `account_no` = '0090900900', `banks`.`updated_at` = '2022-03-20 23:05:42' where `user_id` = '133a9d0b-7265-4c97-b16d-45a1777dba1b'
update `users` set `passport_url` = 'g2Rd5uKDZdmJ2dU8.jpg', `users`.`updated_at` = '2022-03-20 23:05:42' where `id` = '133a9d0b-7265-4c97-b16d-45a1777dba1b' and `users`.`deleted_at` is null
---
            'certification' => $this->certification,
        ]);

        Bank::where('user_id',Auth::user()->id)->update([
            'bank_name' => $this->bank_name,
            'account_name' => $this->account_name,
            'account_no' => $this->account_no
        ]);

        User::where('id',Auth::id())->update([
            'passport_url' => $image,
        ]);

select * from `department_and_zones`
select `bank_name`, `id` from `banktables`
select `name`, `id` from `users` where `id` != '133a9d0b-7265-4c97-b16d-45a1777dba1b' and `name` != 'Administrator' and `users`.`deleted_at` is null
select * from `members` where `user_id` = '133a9d0b-7265-4c97-b16d-45a1777dba1b' limit 1
---
    public function mount()
    {
        $this->departments = DepartmentAndZone::all();
        $this->banks = Banktable::pluck('bank_name','id')->toArray();
        $this->user = User::where('id','!=',Auth::id())->where('name','!=','Administrator')->pluck('name','id')->toArray();
        $this->member = Member::where('user_id',Auth::id())->first();