app/Http/Livewire/UploadProfileImage.php

    public function handleFileUpload($imageData)
    {
        $this->image = $imageData;
        $image = $this->storeImage();//image function
        User::where('id',Auth::id())->update([
            'passport_url' => $image,
        ]);
---
update `users` set `passport_url` = 'lSWWfp95bxNCCgbq.jpg', `users`.`updated_at` = '2022-03-20 23:30:22' where `id` = '133a9d0b-7265-4c97-b16d-45a1777dba1b' and `users`.`deleted_at` is null

    public function storeImage()
    {
        if(!$this->image):
            return null;
        endif;
        $passport = User::where('id',Auth::id())->first()->passport_url;
---
select * from `users` where `id` = '133a9d0b-7265-4c97-b16d-45a1777dba1b' and `users`.`deleted_at` is null limit 1