app/Helpers/LogActivity.php

insert into `log_activities` (`action_performed`, `user_id`, `url`, `method`, `ip_address`, `user_agent`, `updated_at`, `created_at`) values (' User Logged in into Dashboard', '53694d06-bb7d-44bb-9ec9-7b4c319850cb', 'http://localhost:8000/dashboard/home', 'GET', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/99.0.4844.74 Safari/537.36', '2022-03-20 22:46:08', '2022-03-20 22:46:08')
---
    public static function logUserActivity($actionPerformed)
    {
        LogActivityModel::create([
            'action_performed' => $actionPerformed,
            'user_id' => Auth::id(),
            'url' => \Illuminate\Support\Facades\Request::fullUrl(),
            'method' => \Illuminate\Support\Facades\Request::method(),
            'ip_address' => \Illuminate\Support\Facades\Request::ip(),
            'user_agent' => \Illuminate\Support\Facades\Request::header('user_agent'),
        ]);

select * from `log_activities`
---
    public static function getUserActivityLog()
    {
       return LogActivityModel::all()->sortByDesc('id');