app/Http/Controllers/AdminMembershipApplicationApprovalController.php

    public function showMembershipApplication()
    {
        //get all members
        $userDetails = Member::where('certification',true)->get();
---
select * from `members` where `certification` = 1

    public function showMembershipApplicationDetails($application_id)
    {
        $application = Member::where([['id',$application_id]])->firstOrFail();
---
select * from `members` where (`id` = 'da13c791-2e99-44fe-b13b-22a794acb143') limit 1

    public function showMembershipRenewalRequests()
    {
        $renewalRequests = User::where('membership_renewal_status','Request Submitted')->get();
---
select * from `users` where `membership_renewal_status` = 'Request Submitted' and `users`.`deleted_at` is null

    private function secApproveMembership(Request $request)
    {
        $approvalCount = Member::where([['id',$request->application_id],['certification',1]])->firstOrFail();
        $approvalCount = $approvalCount->approval_count + 1;
        $secApproveMembership =  Member::where('id',$request->application_id)->update([
            'approval_count' => $approvalCount,
        ]);
---
select * from `members` where (`id` = '900405fa-e7b7-490e-963c-58a1db1f7747' and `certification` = 1) limit 1
update `members` set `approval_count` = 1, `members`.`updated_at` = '2022-03-20 23:28:34' where `id` = '900405fa-e7b7-490e-963c-58a1db1f7747'

    private function chairApproveMembership(Request $request)
    {
        $memberShipCount = User::all()->count() - 1;
        $membershipID = sprintf('MN'."%'.04d",$memberShipCount+1);
        $approvalCount = Member::where([['id',$request->application_id],['certification',1]])->firstOrFail();
        $approvalCount = $approvalCount->approval_count + 1;
        $chairApproveMembership =  Member::where('id',$request->application_id)->update([
            'approval_count' => $approvalCount,
            'approval_status' => 'Approved',
            'membership_status' => 'Active',
            'member_id' => $membershipID,
        ]);
---
select * from `users` where `users`.`deleted_at` is null
select * from `members` where (`id` = '900405fa-e7b7-490e-963c-58a1db1f7747' and `certification` = 1) limit 1
update `members` set `approval_count` = 2, `approval_status` = 'Approved', `membership_status` = 'Active', `member_id` = 'MN0371', `members`.`updated_at` = '2022-03-20 23:28:44' where `id` = '900405fa-e7b7-490e-963c-58a1db1f7747'