app/Http/Controllers/AdminHomeController.php

    public function showAdminHome()
    {
        $currentMonth = date('Y');
        //Get total loan value
        $total_loan_value = Loan::sum('loan_amount');
        //get total loan recovered
        $total_loan_recovered = Loan::sum('amount_recovered');

        //get total saving
        $total_saving_value = Saving::where('month','LIKE','%'.$currentMonth.'%')->sum('amount_saved');

        //get total debits
        $total_debits = Saving::where('month','LIKE','%'.$currentMonth.'%')->sum('amount_withdrawn');

        //get total transaction
        $total_transaction = Transaction::sum('transaction_amount');

        $total_income = Income::sum('income_realized');

        $total_expense = Expense::sum('total_price');

        //get all loan products
        $products = LoanProduct::all()->toArray();
        //get total members
        $members = User::where([['membership_status','=',true],['is_verified','=',true],['deleted_at','=',null]])->get();

        //get all user transactions
        $transactions = Transaction:: all()->take(5);

        //get all loans
        $loans = Loan::all()->take(5);

        //proposed dividend
        $proposedDividend = Appropriation::where('created_at','LIKE','%'.date('Y').'%')->value('proposed_dividend');
---
select sum(`loan_amount`) as aggregate from `loans`
select sum(`amount_recovered`) as aggregate from `loans`
select sum(`amount_saved`) as aggregate from `savings` where `month` LIKE '%2022%'
select sum(`amount_withdrawn`) as aggregate from `savings` where `month` LIKE '%2022%'
select * from `transactions`
select sum(`transaction_amount`) as aggregate from `transactions`
select sum(`income_realized`) as aggregate from `incomes`
select sum(`total_price`) as aggregate from `expenses` where `expenses`.`deleted_at` is null
select * from `loan_products`
select * from `users` where (`membership_status` = 1 and `is_verified` = 1 and `deleted_at` is null) and `users`.`deleted_at` is null
select * from `loans`
select `proposed_dividend` from `appropriations` where `created_at` LIKE '%2022%' limit 1