app/Http/Controllers/ConfigurationController.php

select * from `department_and_zones`
---
    public function showCreateDepartmentForm()
    {
        $departments = DepartmentAndZone::all();