app/Http/Controllers/HomeController.php

select * from `members` where `user_id` = '53694d06-bb7d-44bb-9ec9-7b4c319850cb' limit 1
select sum(`loan_amount`) as aggregate from `loans` where `user_id` = '53694d06-bb7d-44bb-9ec9-7b4c319850cb'
select sum(`amount_saved`) as aggregate from `savings` where `user_id` = '53694d06-bb7d-44bb-9ec9-7b4c319850cb'
select sum(`amount_withdrawn`) as aggregate from `savings` where `user_id` = '53694d06-bb7d-44bb-9ec9-7b4c319850cb' and `status` = 'Approved'
select * from `transactions` where `user_id` = '53694d06-bb7d-44bb-9ec9-7b4c319850cb' order by `id` desc limit 5
select * from `loans` where `user_id` = '53694d06-bb7d-44bb-9ec9-7b4c319850cb' limit 5
select * from `savings` where `user_id` = '53694d06-bb7d-44bb-9ec9-7b4c319850cb' order by `id` desc limit 4
select sum(`transaction_amount`) as aggregate from `transactions` where `user_id` = '53694d06-bb7d-44bb-9ec9-7b4c319850cb'
select * from `loan_products`
---
    public function renderHomeDashboard()
    {
         $checkUserVerificationStatus = Member::where('user_id',Auth::id())->first();

         if ($checkUserVerificationStatus->approval_count == 0 && $checkUserVerificationStatus->certification == 0 ) {

             return redirect('/UpdateUserProfile');

         } elseif ($checkUserVerificationStatus->approval_count == 1 && $checkUserVerificationStatus->certification == 0) {

             return redirect('/UpdateUserProfile');

         } elseif ($checkUserVerificationStatus->approval_count == 2 && $checkUserVerificationStatus->certification == 0) {

             return redirect('/UpdateUserProfile');

         } elseif ($checkUserVerificationStatus->approval_count == 1 || $checkUserVerificationStatus->approval_count == 2 || $checkUserVerificationStatus->approval_count == 0 && $checkUserVerificationStatus->certification == 1) {

             //Get total loan value
             $total_loan_value = Loan::where('user_id', Auth::id())->sum('loan_amount');

             //get total saving
             $total_saving_value = Saving::where('user_id', Auth::id())->sum('amount_saved');

             $total_withdrawals = Saving::where('user_id', Auth::id())->where('status', 'Approved')->sum('amount_withdrawn');

             //get all user transactions
             $transactions = Transaction::where('user_id', Auth::user()->id)->orderByDESC('id')->limit(5)->get();

             //get all user loans
             $loans = Loan::where('user_id', Auth::id())->limit(5)->get();

             //get all savings
             $savings = Saving::where('user_id', Auth::id())->limit(4)->orderBy('id', 'desc')->get();

             //get total transaction
             $total_transactions = Transaction::where('user_id', Auth::id())->sum('transaction_amount');

             //get all loan products
             $products = LoanProduct::all()->toArray();