app/Http/Controllers/LoanApplicationController.php

    public function checkApplicationStatus()
    {
        $checkExistingLoanApplication = DB::Table('applications')->where('user_id',Auth::id())->first();
        $checkExistingSaving = DB::Table('savings')->where('user_id',Auth::id())->first();
        $multipleLoanPermissionCount = Member::where('user_id',Auth::id())->first();
---
select * from `applications` where `user_id` = '53694d06-bb7d-44bb-9ec9-7b4c319850cb' limit 1
select * from `savings` where `user_id` = '53694d06-bb7d-44bb-9ec9-7b4c319850cb' limit 1
select * from `members` where `user_id` = '53694d06-bb7d-44bb-9ec9-7b4c319850cb' limit 1

    public function showAvailableLoan()
    {
        $loans = DB::table('loans')->where('user_id',Auth::id())->get();
---
select * from `loans` where `user_id` = '53694d06-bb7d-44bb-9ec9-7b4c319850cb'