app/Http/Controllers/TransactionController.php

select * from `transactions` where `user_id` = '53694d06-bb7d-44bb-9ec9-7b4c319850cb'
---
    public function showUserTransaction()
    {
        $transactions = Transaction::where('user_id',Auth::id())->get();