app/Http/Controllers/UserProfileController.php

select `name`, `id` from `users` where `id` != '133a9d0b-7265-4c97-b16d-45a1777dba1b' and `name` != 'Administrator' and `users`.`deleted_at` is null
select `bank_name`, `id` from `banktables`
select * from `members` where `user_id` = '133a9d0b-7265-4c97-b16d-45a1777dba1b' limit 1
select * from `department_and_zones`
---
    public function showUserProfileForm()
    {
        //dd('Loading Form');
        $users = User::where('id','!=',Auth::id())->where('name','!=','Administrator')->pluck('name','id')->toArray();
        $banks = Banktable::pluck('bank_name','id')->toArray();
        $member = Member::where('user_id',Auth::id())->first();
        $departments = DepartmentAndZone::all();